Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.PrintDrawing Method (Drawing, PrintAttributes, String)
 Prints the drawing to file using the given printer instance. NOTE! The drawing cannot be active, otherwise printing fails.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool PrintDrawing(
	Drawing drawing,
	PrintAttributes printAttributes,
	string fileName
)
Public Function PrintDrawing (
	drawing As Drawing,
	printAttributes As PrintAttributes,
	fileName As String
) As Boolean
Parameters
drawing
Type: Tekla.Structures.Drawing.Drawing
The drawing to be printed.
printAttributes
Type: Tekla.Structures.Drawing.PrintAttributes
The print attributes for the print job.
fileName
Type: System.String
The name of the output file.
Return Value
Type: Boolean
True on success, false if printing fails.
See Also
Reference
DrawingHandler Class
PrintDrawing Overload
Tekla.Structures.Drawing Namespace